# ============================================
# Homebrew Package List
# ============================================

# Taps (third-party repositories)
# tap "homebrew/cask-fonts"

# Core tools
brew "starship"           # Modern prompt

# Modern CLI replacements (optional - uncomment to install)
brew "eza"              # Better 'ls'
brew "zoxide"           # Smarter 'cd'

### Development tools
brew "git"
brew "asdf"

### Applications (GUI apps)
cask "visual-studio-code"
cask "zen"
cask "todoist"
cask "1password"

# Media
cask "spotify"

# Utilities
cask "amphetamine"
cask "dato"
cask "vanilla"
cask "reflex"
cask "rocket"
cask "appcleaner"
cask "raycast"
cask "web-catalog"

# Communication
cask "signal"
cask "whatsapp"

# Work
cask "vscode"
cask "docker-desktop"
cask "figma"
cask "loom"