# ============================================
# Homebrew Package List
# ============================================

# Modern CLI
cask "ghostty"
brew "starship"           # Modern prompt
brew "eza"              # Better 'ls'
brew "zoxide"           # Smarter 'cd'
brew "zsh-autosuggestions"

### Development tools
brew "git"
brew "asdf"

### Applications (GUI apps)
cask "visual-studio-code"
cask "zen"
cask "todoist-app"
cask "1password"

# Media
cask "spotify"

# Utilities
# cask "amphetamine"
# cask "dato"
cask "vanilla"
cask "reflex-app"
cask "rocket"
cask "appcleaner"
cask "raycast"
# cask "web-catalog"

# Communication
cask "signal"
cask "whatsapp"

# Work
cask "docker-desktop"
cask "figma"
cask "loom"

# Fonts
cask "font-fira-code-nerd-font"